# -*- coding: UTF-8 -*-

ru = {} 
ru['authors'] = "Реализован Владиславом Сидоренко, ФПМ. Идея Владислава Кампова."
ru['change_lang'] = "Язык бота был изменён на русский."
ru['email_sent'] = "Ваш запрос был успешно отправлен разработчику."
ru['empty_group'] = "Вы не уточнили группу. Сохраните её в базе с помощью команды /setgroup [№группы]\
 или же передайте группу как параметр: /tt [№группы]"
ru['empty_week_param'] = "Вы не ввели номер недели"
ru['get_tt_error'] = "К сожалению я не смог получить расписание. Все вопросы не ко мне :)"
ru['instructions'] = "/setgroup [Код твоей группы] — таким образом я тебя запомню для дальнейшей нашей совместной жизни.\n\
(Пример: /setgroup КВ-32 или /setgroup kv-32)\n\
/today — этой командой я покажу тебе расписание на сегодня.\n\
/teacher — вместе с названиями предметов покажу тебе имена преподавателей.\n\
/tomorrow — этой командой я смогу тебе показать расписание на завтра.\n\
/now — напомню тебе, какая пара у тебя сейчас и сколько времени осталось до её конца.\n\
/next — расскажу тебе, какая же пара следующая.\n\
/who — напомню тебе, как зовут преподавателя, который стоит перед тобой.\n\
/tt — покажу полное расписание на все недели.\n\n\
А ещё к каждой из команд можно добавить параметры\n\
- Номер группы в виде КВ-32 или kv-32 чтобы отобразить расписание для любой конкретной группы\n\
(Например, \"/today kv-52/\" покажет расписание на сегодня для группы КВ-52)\n\
- Номер недели в ввиде w1 и w2 для вывода результата для первой или второй недели обучения соответственно\n\
(Например, \"/tt w1\" покажет полное расписание первой недели, а \"/today w2\" посмотрит, какой сегодня день недели, и покажет расписание этого дня на второй неделе)\n\
- Ты можешь посмотреть расписание на конкретный день используя \"/tt 1\", где \"1\" — номер дня недели. Да, \"/tt mon\" и \"/tt пн\" работают тоже.\n\n\
А самое главное, что все эти параметры ты можешь комбинировать! Причем в любом порядке!\n\
Несколько примеров:\n\
- /tt ia-25 w1\n\
- /tt w2 mon IA-52\n\
- /tt KM-21 3 w1\n\
Использование неправильных параметров выдаст ошибку"
ru['minutes_left'] = "-- Осталось {0} минут до конца пары"
ru['no_lesson'] = "Сейчас пары нет. Отдыхай"
ru['no_teacher'] = "неизвестно"
ru['no_required_parameter'] = "Обязательный параметр не задан."
ru['no_room'] = "К сожалению, кабинет не задан."
ru['no_week'] = "Уточните неделю."
ru['no_week_or_day'] = "Для того, чтобы смотреть конкретную пару нужно ввести номер недели и день недели"
ru['setgroup_empty_param'] = "Вы не написали код группы"
ru['setgroup_success'] = "Я запомнил вашу группу, ура. Вы в любой момент можете изменить группу использовав команду /setgroup"
ru['setteacher_filter'] = "Для того, чтобы включить режим преподавателя наберите /setteacher id, возможно вы имели ввиду:\n"
ru['setteacher_success'] = "Режим преподавателя активирован. Добро пожаловать"
ru['sunday'] = "Это же воскресенье. Наслаждайся отдыхом, какое расписание?"
ru['unknown_room'] = "расположение неизвестно"
ru['week'] = "Сейчас {0} неделя"
ru['week_days'] = {1 : "Понедельник", 2: "Вторник", 3 : "Среда",\
                   4 : "Четверг", 5 : "Пятница", 6 : "Суббота"}
ru['unknown_group'] = "Подобной группы нет в базе. Проверьте правильность ввода"
ru['unknown_teacher'] = "Преподаватель соответствующий запросу не найден."
ru['wrong_command_for_tm'] = "В режиме преподавателя нет команды /who"
ru['wrong_parameter'] = "Неправильный параметр"
ru['wrong_parameter_for_command'] = "У команды {0} не может быть подобных параметров."
ru['wrong_parameter_for_teacher'] = "Неправильный параметр в режиме преподавателя"
ru['wrong_parameters_number'] = "Неправильное количество параметров"
ru['wrong_week_param'] = "Вы ввели неправильную неделю. Можно запросить расписание либо на 1 неделю, либо на вторую"

ua = {}
ua['authors'] = "Реалізован Владиславом Сидоренко, ФПМ. Ідея Владислава Кампова."
ua['change_lang'] = "Мову бота було змінено на українську"
ua['email_sent'] = "Ваш запит було успішно відправлено розробнику."
ua['empty_group'] = "Ваша група не відома. Збережіть ії в базі за допомогою команди /setgroup [№групи]\
                    або передайте групу як параметр : /tt [№групи]"
ua['empty_week_param'] = "Ви не ввели номер тижня"
ua['get_tt_error'] = "Нажаль я не зміг отримати розклад. Всі питання не до мене :)"
ua['help'] = "/setgroup [Код твоєї групи] — таким чином я запам'ятаю тебе для нашого подальшого спільного життя.\n\
(Приклад: /setgroup КВ-32 або /setgroup kv-32)\n\
/today — цією командою я покажу тобі розклад на сьогодня.\n\
/teacher — разом за назвами предметів я покажу тобі імена викладачів.\n\
/tomorrow — цією командою я зможу показати тобі розклад на завтра.\n\
/now — нагадаю, яка ж пара в тебе зараз і скільки часу залишилось до її кінця.\n\
/next — розповім тобі, яка ж пара наступна.\n\
/who — нагадаю, як звуть викладача, який стоїть прямо перед тобою.\n\
/tt — покажу повний розклад на 2 тижні.\n\n\
А ще до кожної з команд можна додати параметри:\n\
- Номер групи у вигляді КВ-32 або kv-32 щоб відобразити розклад для конкретної групи\n\
(Наприклад, \"/today kv-52/\" покаже розклад на сьогодня для групи КВ-52)\n\
- Номер тижня у вигляді w1 та w2 для виводу разультату для першого та другого тижня відповідно\n\
(Наприклад, \"/tt w1\" покаже повний розклад для першого тижня, а \"/today w2\" подивиться, який сьогодні день, і видасть розклад цього дня на другому тижні)\n\
- Ти можешь подивитися розклад на конкретний день використовуючи \"/tt 1\", де \"1\" — номер дня тижня. Так, \"/tt mon\" і \"/tt пн\" працюють також.\n\n\
А найголовніше, що усі ці параметри ти можеш комбінувати! При чому у будь-якому порядку!\n\
Декілька прикладів:\n\
- /tt ia-25 w1\n\
- /tt w2 mon IA-52\n\
- /tt KM-21 3 w1\n\
Використання неправильних параметрів видасть помилку"
ua['minutes_left'] = "-- Залишилось {0} хвилин до кінця пари"
ua['no_lesson'] = "Зараз пари немає. Відпочивай"
ua['no_teacher'] = "не задано"
ua['setgroup_success'] = "Вас було успішно занесено до бази. Ви в будь-який момент\
 зможете змінити групу використав команду /setgroup"
ua['setgroup_empty_param'] = "Ви не написали код групи"
ua['setgroup_fail'] = "Такої групи немає в базі. Перевірте правильність вводу"
ua['should_specify_params'] = "Для того, щоб дивитися конкретну пару потрібно задати номер тижня та день"
ua['sunday'] = "Сьогодні неділя. Який розклад, насолоджуйся відпочинком"
ua['unknown_roon'] = "розположення невідомо"
ua['week'] = "Зараз {0} тиждень"
ua['week_days'] = {1 : "Понеділок", 2 : "Вівторок", 3 : "Середа", \
                   4 : "Четвер", 5 : "П'ятниця", 6 : "Субота"}
ua['wrong_param'] = "Неправильний параметр"
ua['wrong_parameters_for_command'] = "У команди {0} не може бути подібних параметрів"
ua['wrong_week_param'] = "Ви ввели невірний тиждень. Ви можете писати лише 1 чи 2"