# -*- coding: UTF-8 -*-

ru = {} 
ru['authors'] = "Авторы:\n\
Владислав Сидоренко: vk.com/vlad_sidorenko\n\
Владислав Кампов: vk.com/vladkampov\n\
Антон Тименко: vk.com/antontimenko"
ru['change_lang'] = "Язык бота был изменён на русский."
ru['email_sent'] = "Ваш запрос был успешно отправлен разработчику."
ru['empty_group'] = "Вы не уточнили группу. Сохраните её в базе с помощью команды /setgroup [код группы]\
 или же передайте группу как параметр: /tt [код группы]"
ru['empty_week_param'] = "Вы не ввели номер недели"
ru['get_tt_error'] = "К сожалению, я не смог получить расписание. Все вопросы не ко мне :)"
ru['instructions'] = "/setgroup [Код твоей группы] — таким образом я тебя запомню твою группу для дальнейшей нашей совместной жизни (если ты студент).\n\
(Пример: /setgroup КВ32 или /setgroup kv-32)\n\
/setteacher [фамилия] — а если ты преподаватель, то тебе стоит воспользоваться этой командой (писать на украинском языке)\n\
(Пример: /setteacher Іва (если фамилия Иванов, Ивашин, Иваненко, т.д.))\n\
/next — расскажу тебе, какая же пара следующая.\n\
/now — напомню тебе, какая пара у тебя сейчас и сколько времени осталось до её конца.\n\
/time — просто выведу тебе время начала всех пар\n\
/today — этой командой я покажу тебе расписание на сегодня.\n\
/tomorrow — этой командой я смогу тебе показать расписание на завтра.\n\
/tt — покажу полное расписание на все недели.\n\
/week — помогу узнать, какая сейчас учебная неделя\n\
/where — не дам тебе потеряться - скину карту с местоположением текущей аудитории\n\
/who — напомню тебе, как зовут преподавателя, который стоит перед тобой.\n\n\
А ещё к каждой из команд можно добавить параметры\n\
- Номер группы в виде КВ-32 или kv-32 чтобы отобразить расписание для любой конкретной группы\n\
(Например, \"/today kv-52\" покажет расписание на сегодня для группы КВ-52)\n\
- Номер недели в ввиде w1 и w2 для вывода результата для первой или второй недели обучения соответственно\n\
(Например, \"/tt w1\" покажет полное расписание первой недели)\n\
- Параметр w выведет расписание на текущую неделю.\n\
(Например, если сейчас вторая неделя, то \"/tt w\" выведет расписание на всю вторую неделю)\
- С помощью параметра t ты сможешь показать имена преподавателей. Этот параметр можно использовать почти с любой командой.\n\
- Ты можешь посмотреть расписание на конкретный день используя, например, \"/tt mon\" или \"/tt пн\".\n\n\
А самое главное, что все эти параметры ты можешь комбинировать! Причем в любом порядке!\n\
Несколько примеров:\n\
- /tt ia-25 w1\n\
- /tt w2 mon IA-52\n\
- /tt KM-21 w t\n\
Использование неправильных параметров выдаст ошибку"
ru['minutes_left'] = "— Осталось {0} минут до конца пары"
ru['no_lesson'] = "Этой пары нет. Отдыхай"
ru['no_teacher'] = "неизвестно"
ru['no_required_parameter'] = "Обязательный параметр не задан."
ru['no_room'] = "К сожалению, кабинет не задан."
ru['no_timetable_for_group'] = "К сожалению, для вашей группы нет расписания."
ru['no_week'] = "Уточните неделю."
ru['no_week_or_day'] = "Для того, чтобы смотреть конкретную пару нужно ввести номер недели и день недели"
ru['reminder_on'] = "Напоминалка была включена."
ru['reminder_off'] = "Напоминалка была выключена."
ru['same_group'] = "Существует несколько групп, имеющих подобное название. Выберите одну из групп ниже:"
ru['setgroup_empty_param'] = "Вы не написали код группы."
ru['setgroup_success'] = "Я запомнил вашу группу, ура. Вы в любой момент можете изменить группу использовав команду /setgroup"
ru['setteacher_filter'] = "Для того, чтобы включить режим преподавателя, наберите /setteacher id_преподавателя.\nid_преподавателя вы можете взять из списка, который ниже.\nСписок преподавателей, в ФИО которых есть \'{0}\':\n"
ru['setteacher_success'] = "Режим преподавателя активирован. Добро пожаловать"
ru['sunday'] = "Это же воскресенье. Наслаждайся отдыхом, какое расписание?"
ru['teacher_tt'] = "Выберите id преподавателя из списка ниже:\n"
ru['unknown_group'] = "Подобной группы нет в базе. Проверьте правильность ввода"
ru['unknown_room'] = "расположение неизвестно"
ru['unknown_teacher'] = "Преподаватель соответствующий запросу не найден."
ru['week'] = "Сейчас {0} неделя"
ru['week_days'] = {1 : "Понедельник", 2: "Вторник", 3 : "Среда",\
                   4 : "Четверг", 5 : "Пятница", 6 : "Суббота"}
ru['wrong_command_for_tm'] = "В режиме преподавателя нет команды /who"
ru['wrong_parameter'] = "Неправильный параметр"
ru['wrong_parameter_for_command'] = "У команды {0} не может быть подобных параметров."
ru['wrong_parameter_for_teacher'] = "Неправильный параметр в режиме преподавателя."
ru['wrong_parameters_number'] = "Неправильное количество параметров."
ru['wrong_week_param'] = "Вы ввели неправильную неделю. Можно запросить расписание либо на 1 неделю, либо на вторую"

ua = {}
ua['authors'] = "Автори:\n\
Владислав Сидоренко: vk.com/vlad_sidorenko\n\
Владислав Кампов: vk.com/vladkampov\n\
Антон Тіменко: vk.com/antontimenko"
ua['change_lang'] = "Мову бота було змінено на українську"
ua['email_sent'] = "Ваш запит було успішно відправлено розробнику."
ua['empty_group'] = "Ваша група не відома. Збережіть ії в базі за допомогою команди /setgroup [код групи]\
                    або передайте групу як параметр : /tt [код групи]"
ua['empty_week_param'] = "Ви не ввели номер тижня"
ua['get_tt_error'] = "Нажаль, я не зміг отримати розклад. Всі питання не до мене :)"
ua['instructions'] = "/setgroup [Код твоєї групи] — таким чином я запам'ятаю тебе для нашого подальшого спільного життя.\n\
(Приклад: /setgroup КВ-32 або /setgroup kv-32)\n\
/setteacher [прізвище] — а якщо ти викладач, то тобі варто використовувати цю команду (писати українською мовою)\n\
(Приклад: /setteacher Іва (якщо прізвище Іванов, Івашин, Іваненко, т.д.))\n\
/today — цією командою я покажу тобі розклад на сьогодня.\n\
/tomorrow — цією командою я зможу показати тобі розклад на завтра.\n\
/now — нагадаю, яка ж пара в тебе зараз і скільки часу залишилось до її кінця.\n\
/next — розповім тобі, яка ж пара наступна.\n\
/time — просто выведу тебе время начала всех пар\n\
/tt — покажу повний розклад на 2 тижні.\n\
/who — нагадаю, як звуть викладача, який стоїть прямо перед тобою.\n\n\
А ще до кожної з команд можна додати параметри:\n\
- Номер групи у вигляді КВ-32 або kv-32 щоб відобразити розклад для конкретної групи\n\
(Наприклад, \"/today kv-52\" покаже розклад на сьогодня для групи КВ-52)\n\
- Номер тижня у вигляді w1 та w2 для виводу разультату для першого та другого тижня відповідно\n\
(Наприклад, \"/tt w1\" покаже повний розклад для першого тижня, а \"/today w2\" подивиться, який сьогодні день, і видасть розклад цього дня на другому тижні)\n\
- Ти можешь подивитися розклад на конкретний день використовуючи \"/tt mon\" або \"/tt пн\", де mon - день тижня (понеділок, в даному випадку).\n\n\
- Параметр w виведе розклад на поточний тиждень.\n\
(Наприклад, якщо зараз другий тиждень, то \"/tt w\" виведе розклад на весь другий тиждень)\n\
- За допомогою параметра t ти можешь показувати імена викладачів. Цей параметр можна використовувати майже з будь-якою командою.\n\
А найголовніше, що усі ці параметри ти можеш комбінувати! При чому у будь-якому порядку!\n\
Декілька прикладів:\n\
- /tt ia-25 w1\n\
- /tt w2 mon IA-52\n\
- /tt KM-21 3 w\n\
Використання неправильних параметрів видасть помилку"
ua['minutes_left'] = "— Залишилось {0} хвилин до кінця пари"
ua['no_lesson'] = "Цієї пари немає. Відпочивай"
ua['no_teacher'] = "не задано"
ua['no_required_parameter'] = "Обов'язковий параметр не було задано."
ua['no_room'] = "Нажаль, кабінет не було задано."
ua['no_timetable_for_group'] = "Нажаль розкладу для вашої групи немає."
ua['no_week'] = "Введіть тиждень."
ua['no_week_or_day'] = "Для того, щоб дивитися конкретну пару потрібно ввести номер тижня та день тижня"
ua['reminder_on'] = "Нагадувалку було активовано."
ua['reminder_off'] = "Нагадувалку було деактивовано."
ua['setgroup_empty_param'] = "Ви не написали код групи."
ua['same_group'] = "Існує декілька груп, що мають подібну назву. Оберіть одну з перелічених нижче:"
ua['setgroup_success'] = "Я вас запам'ятав, ура. Ви в будь-який момент зможете змінити групу використав команду /setgroup"
ua['setteacher_filter'] = "Для того, щоб включити режим викладача, введіть команду /setgroup id_викладача.\nid_викладача ви можете взяти зі списку, що внизу.\nСписок викладачів, ПІБ яких містить \'{0}\':\n"
ua['setteacher_success'] = "Режим викладача було активовано. Вітаю."
ua['sunday'] = "Це ж неділя. Який розклад, насолоджуйся відпочинком."
ua['teacher_tt'] = "Оберіть id викладача зі списку, що внизу:\n"
ua['unknown_room'] = "розположення невідомо"
ua['week'] = "Зараз {0} тиждень"
ua['week_days'] = {1 : "Понеділок", 2 : "Вівторок", 3 : "Середа", \
                   4 : "Четвер", 5 : "П'ятниця", 6 : "Субота"}
ua['unknown_group'] = "Такої групи немає в базі. Перевірте правильність вводу."
ua['unknown_teacher'] = "Викладач, що задовольняе запит, не був знайдений."
ua['wrong_command_for_tm'] = "В режимі викладача немає команди /who"
ua['wrong_parameter'] = "Неправильный параметр"
ua['wrong_parameter_for_command'] = "Команда {0} не може мати подібних параметрів."
ua['wrong_parameter_for_teacher'] = "Неправильный параметр в режимі викладача."
ua['wrong_parameters_number'] = "Неправильна кількість параметрів."
ua['wrong_week_param'] = "Вы ввели неправильний тиждень. Можна запросити розклад на або перший тиждень, або на другий."