# -*- coding: UTF-8 -*-
ru = {} 
ru['authors'] = u"Реализован Владиславом Сидоренко, ФПМ. Идея Владислава Кампова."
ru['change_lang'] = u"Язык бота был изменён на русский"
ru['empty_group'] = u"Вы не уточнили группу. Сохраните её в базе с помощью команды /setgroup [№группы]\
 или же передайте группу как параметр: /tt [№группы]"
ru['empty_week_param'] = u"Вы не ввели номер недели"
ru['get_tt_error'] = u"К сожалению я не смог получить расписание. Все вопросы не ко мне :)"
ru['help'] = u"/setgroup [Код твоей группы] — таким образом я тебя запомню для дальнейшей нашей совместной жизни.\n\
(Пример: /setgroup КВ-32 или /setgroup kv-32)\n\
/today — этой командой я покажу тебе расписание на сегодня.\n\
/teacher — вместе с названиями предметов покажу тебе имена преподавателей.\n\
/tomorrow — этой командой я смогу тебе показать расписание на завтра\n\
/now — напомнит тебе, какая пара у тебя сейчас\n\
/next — расскажет тебе, какая же пара следующая\n\
/who — напомнит тебе, как зовут преподавателя, который стоит перед тобой\n\
/tt — отображает полное расписание на все недели\n\n\
А ещё к каждой из команд можно добавить параметры\n\
- Номер группы в виде КВ-32 или kv-32 чтобы отобразить расписание для любой конкретной группы\n\
(Например, \"/today kv-52/\" покажет расписание на сегодня для группы КВ-52)\n\
- Номер недели в ввиде w1 и w2 для вывода результата для первой или второй недели обучения соответственно\n\
(Например, \"/tt w1\" покажет полное расписание первой недели, а \"/today w2\" посмотрит, какой сегодня день недели, и покажет расписание этого дня на второй неделе)\n\
- Ты можешь посмотреть расписание на конкретный день используя \"/tt 1\", где \"1\" — номер дня недели. Да, \"/tt mon\" и \"/tt пн\" работают тоже.\n\n\
А самое главное, что все эти параметры ты можешь комбинировать! Причем в любом порядке!\n\
Несколько примеров:\n\
- /tt ia-25 w1\n\
- /tt w2 mon IA-52\n\
- /tt KM-21 3 w1\n\
Использование неправильных параметров выдаст ошибку"
ru['setgroup_empty_param'] = u"Вы не написали код группы"
ru['setgroup_fail'] = u"Подобной группы нет в базе. Проверьте правильность ввода"
ru['setgroup_success'] = u"Я запомнил вашу группу, ура. Вы в любой момент\
 можете изменить группу использовав команду /setgroup"
ru['sunday'] = u"Сегодня воскресенье. Наслаждайся отдыхом, какое расписание?"
ru['unknown_room'] = u"расположение неизвестно"
ru['week_days'] = {1 : u"Понедельник", 2: u"Вторник", 3 : u"Среда",\
                   4 : u"Четверг", 5 : u"Пятница", 6 : u"Суббота"}
ru['wrong_param'] = u"Неправильный параметр"
ru['wrong_week_param'] = u"Вы ввели неправильную неделю. Можно запросить расписание либо на 1 неделю, либо на вторую"

ua = {}
ua['authors'] = u"Реалізован Владиславом Сидоренко, ФПМ. Ідея Владислава Кампова."
ua['change_lang'] = u"Мову бота було змінено на українську"
ua['empty_group'] = u"Ваша група не відома. Збережіть ії в базі за допомогою команди /setgroup [№групи]\
                    або передайте групу як параметр : /tt [№групи]"
ua['empty_week_param'] = u"Ви не ввели номер тижня"
ua['get_tt_error'] = u"Нажаль я не зміг отримати розклад. Всі питання не до мене :)"
ua['help'] = u"/setgroup [Код твоєї групи] — таким чином я запам'ятаю тебе для нашого подальшого спільного життя.\n\
(Приклад: /setgroup КВ-32 або /setgroup kv-32)\n\
/today — цією командою я покажу тобі розклад на сьогодня.\n\
/teacher — разом за назвами предметів я покажу тобі імена викладачів.\n\
/tomorrow — цією командою я зможу показати тобі розклад на завтра\n\
/now — напомнит тебе, какая пара у тебя сейчас\n\
/next — розповість тобі, яка ж пара наступна\n\
/who — нагадає, як звуть викладача, який стоїть прямо перед тобою\n\
/tt — показує повний розклад на 2 тижні\n\n\
А ще до кожної з команд можна додати параметри:\n\
- Номер групи у вигляді КВ-32 або kv-32 щоб відобразити розклад для конкретної групи\n\
(Наприклад, \"/today kv-52/\" покаже розклад на сьогодня для групи КВ-52)\n\
- Номер тижня у вигляді w1 та w2 для виводу разультату для першого та другого тижня відповідно\n\
(Наприклад, \"/tt w1\" покаже повний розклад для першого тижня, а \"/today w2\" подивиться, який сьогодні день, і видасть розклад цього дня на другому тижні)\n\
- Ти можешь подивитися розклад на конкретний день використовуючи \"/tt 1\", де \"1\" — номер дня тижня. Так, \"/tt mon\" і \"/tt пн\" працюють також.\n\n\
А найголовніше, що усі ці параметри ти можеш комбінувати! При чому у будь-якому порядку!\n\
Декілька прикладів:\n\
- /tt ia-25 w1\n\
- /tt w2 mon IA-52\n\
- /tt KM-21 3 w1\n\
Використання неправильних параметрів видасть помилку"
ua['setgroup_success'] = u"Вас було успішно занесено до бази. Ви в будь-який момент\
 зможете змінити групу використав команду /setgroup"
ua['setgroup_empty_param'] = u"Ви не написали код групи"
ua['setgroup_fail'] = u"Такої групи немає в базі. Перевірте правильність вводу"
ua['sunday'] = u"Сьогодні неділя. Який розклад, насолоджуйся відпочинком"
ua['unknown_roon'] = u"розположення невідомо"
ua['week_days'] = {1 : u"Понеділок", 2 : u"Вівторок", 3 : u"Середа", \
                   4 : u"Четвер", 5 : u"П'ятниця", 6 : u"Субота"}
ua['wrong_param'] = u"Неправильний параметр"
ua['wrong_week_param'] = u"Ви ввели невірний тиждень. Ви можете писати лише 1 чи 2"